Catalogs/SKU.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>SKU</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.SKUGroup</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Brand</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Brands</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CommonStock</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UnitsOfMeasure</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultPicture</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultPictureExtension</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalId</Name>
					<Comment>ГУИД номенклатуры. Указывается только для элементов созданных на основании серии для последующей связи с номенклатурой владельцем в УТ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Packing</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Pack</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UnitsOfMeasure</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Multiplier</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Stocks</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Feature</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SKUFeatures</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Stock</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Stock</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StockValue</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/bitmobile_ХранилищеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>bitmobile_ХранилищеФайлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлЗаблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bitmobile_НаправленияСинхронизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bitmobile_ДействияПриСинхронизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/AssortmentMatrixSKUs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>AssortmentMatrixSKUs</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Qty</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UnitsOfMeasure</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SKUStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ValueTableRowStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseUnitQty</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>AssortmentMatrix</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AssortmentMatrix</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SKU</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/bitmobile_ДействияПриСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>bitmobile_ДействияПриСинхронизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДобавитьФайл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьФайл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/bitmobile_НаправленияСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>bitmobile_НаправленияСинхронизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Private</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Shared</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/SKU/Forms/ItemForm/Ext/Form/Module.bsl
#Region CommonProcedureAndFunctions

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	PredefinedItems = New Map;
	PredefinedItems.Insert("Catalog.Brands", "Brand");
	PredefinedItems.Insert("Catalog.UnitsOfMeasure", "BaseUnit");
	PredefinedItems.Insert("Catalog.SKUGroup", "Owner");
	
	ItemsCollection = CommonProcessors.GetPredefinedItems(PredefinedItems);
	
	For Each Item In ItemsCollection Do
		
		Object[Item.Key] = Item.Value;

	EndDo;
	
	CheckBaseUnitAndMultiplier();
	
	If ValueIsFilled(Object.DefaultPicture) Then 	
		
		ThumbnailSize = Constants.SizeOfThumbnailPhotos.Get();
		
		Connection = CommonProcessors.GetConnectionToServer();
		
		Path = CommonProcessors.GetWebDAVPathOnServer();
		
		Query = New Query;
		Query.Text = 
			"SELECT ALLOWED TOP 1
			|	bitmobile_ХранилищеФайлов.Объект,
			|	bitmobile_ХранилищеФайлов.НаправлениеСинхронизации,
			|	bitmobile_ХранилищеФайлов.Действие,
			|	bitmobile_ХранилищеФайлов.ИмяФайла,
			|	bitmobile_ХранилищеФайлов.ПолноеИмяФайла,
			|	bitmobile_ХранилищеФайлов.Расширение,
			|	bitmobile_ХранилищеФайлов.Хранилище
			|FROM
			|	InformationRegister.bitmobile_ХранилищеФайлов AS bitmobile_ХранилищеФайлов
			|WHERE
			|	bitmobile_ХранилищеФайлов.Объект = &ObjectRef
			|	AND bitmobile_ХранилищеФайлов.Действие <> &DeleteAction
			|	AND bitmobile_ХранилищеФайлов.ИмяФайла = &FileName
			|	AND bitmobile_ХранилищеФайлов.НаправлениеСинхронизации = &SyncDirection";
			
		Query.SetParameter("DeleteAction", Enums.bitmobile_ДействияПриСинхронизации.УдалитьФайл);
		Query.SetParameter("SyncDirection", Enums.bitmobile_НаправленияСинхронизации.Shared);
		Query.SetParameter("ObjectRef", Object.Ref);
		Query.SetParameter("FileName", Object.DefaultPicture);
		
		Result = Query.Execute();
		
		Records = Result.Select();
		
		If Records.Next() Then 
			
			// Забираем бинарные данные из таблицы файлов
			BinaryDataOfFile = Records.Хранилище.Get();
			
			// Если бинарные данные есть
			If ValueIsFilled(BinaryDataOfFile) Then
				
				PictureAddress = PutToTempStorage(BinaryDataOfFile, ThisForm.UUID);
				
			// Если нет бинарных данных
			Else
				
				// Если соединение было создано успешно
				If Not Connection = Undefined Then
					
					// Пробуем забрать файл
					Try
						
						WebDAVFile = GetTempFileName(Records.Расширение);
						
						If ThumbnailSize > 0 Then 
							
							Connection.Get(Path + Lower(Records.ПолноеИмяФайла) + "?size=" + Format(ThumbnailSize, "NG=0"), WebDAVFile);
							
						Else 
							
							Connection.Get(Path + Lower(Records.ПолноеИмяФайла), WebDAVFile);
							
						EndIf;
						
						BinaryDataOfFile = New BinaryData(WebDAVFile);
						
						PictureAddress 	= PutToTempStorage(BinaryDataOfFile, ThisForm.UUID);
						
					// Не получилось забрать файл
					Except
						
					EndTry;
					
				EndIf;
				
			EndIf;
			
		EndIf;
		
	EndIf;
	
	DefaultPictureName = Object.DefaultPicture;
	DefaultPictureExtension = Object.DefaultPictureExtension;
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	If Not ValueIsFilled(Object.DefaultPicture) Then
		
		If ValueIsFilled(NewPictureName) Then
			
			CurrentObject.DefaultPicture = NewPictureName;
			CurrentObject.DefaultPictureExtension = NewPictureExtension;
			
		EndIf;
		
	EndIf;
	
EndProcedure

&AtServer
Procedure OnWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	If Not Cancel Then 
	
		If CurrentObject.DefaultPicture = NewPictureName And ValueIsFilled(NewPictureName) Then 
			
			If NewPictureType = "New" Then 
				
				BinaryData	= GetFromTempStorage(PictureAddress);
				
				RecordManager							= InformationRegisters.bitmobile_ХранилищеФайлов.CreateRecordManager();
				RecordManager.Объект					= CurrentObject.Ref;
				RecordManager.НаправлениеСинхронизации	= Enums.bitmobile_НаправленияСинхронизации.Shared;
				RecordManager.Действие					= Enums.bitmobile_ДействияПриСинхронизации.ДобавитьФайл;
				RecordManager.ИмяФайла					= NewPictureName;
				RecordManager.Расширение				= Lower(NewPictureExtension);
				RecordManager.Хранилище					= New ValueStorage(BinaryData);
				RecordManager.ПолноеИмяФайла			= "/shared/Catalog.SKU/" + 
															CurrentObject.Ref.UUID() + 
															"/" + 
															NewPictureName + 
															Lower(NewPictureExtension);
				
				RecordManager.Write();
				
			ElsIf NewPictureType = "Private" Then 
				
				RecordSetPrivate = InformationRegisters.bitmobile_ХранилищеФайлов.CreateRecordSet();
				RecordSetPrivate.Filter.ИмяФайла.Set(NewPictureName, True);
				RecordSetPrivate.Filter.НаправлениеСинхронизации.Set(Enums.bitmobile_НаправленияСинхронизации.Private, True);
				RecordSetPrivate.Filter.Объект.Set(CurrentObject.Ref, True);
				
				RecordSetPrivate.Read();
				
				If Not RecordSetPrivate.Count() = 0 Then
					
					RecordManagerShared = InformationRegisters.bitmobile_ХранилищеФайлов.CreateRecordManager();
					
					FillPropertyValues(RecordManagerShared, RecordSetPrivate[0]);
					
					BinaryData = GetFromTempStorage(PictureAddress);
					
					RecordManagerShared.НаправлениеСинхронизации	= Enums.bitmobile_НаправленияСинхронизации.Shared;
					RecordManagerShared.Действие					= Enums.bitmobile_ДействияПриСинхронизации.ДобавитьФайл;
					RecordManagerShared.Хранилище					= New ValueStorage(BinaryData);
					RecordManagerShared.ПолноеИмяФайла				= "/shared/Catalog.SKU/" + 
																		CurrentObject.Ref.UUID() + 
																		"/" + 
																		NewPictureName + 
																		Lower(NewPictureExtension);
					
					RecordManagerShared.Write();
					
					For Each Record In RecordSetPrivate Do 
						
						Record.Действие = Enums.bitmobile_ДействияПриСинхронизации.УдалитьФайл;
						
					EndDo;
					
					RecordSetPrivate.Write();
					
				EndIf;
				
			EndIf;
			
		EndIf;
		
	EndIf;
	
EndProcedure

&AtServer
Procedure CheckBaseUnitAndMultiplier()
	
	If ValueIsFilled(Object.BaseUnit) Then 
	
		ParameterFilter = new Structure;
		ParameterFilter.Insert("Pack", Object.BaseUnit);
		
		FoundRow = Object.Packing.FindRows(ParameterFilter);
		
		If FoundRow.Count() = 0 Then
			
			NewRow				= Object.Packing.Add();
			NewRow.Pack			= Object.BaseUnit;
			NewRow.Multiplier	= 1;
			
			UserMessage			= New UserMessage;
			UserMessage.Text	= NStr("en='Warning, new base unit has multiplier 1. Check multipliers corectness, please.';ru='Внимание, новая базовая единица имеет коэффициент 1. Проверьте, пожалуйста, коэффициенты на правильность.';cz='Warning, new base unit has multiplier 1. Check multipliers corectness, please.'");
			
			UserMessage.Message();
			
		Else
			
			If Not FoundRow[0].Multiplier = 1 Then 
				
				FoundRow[0].Multiplier = 1;
				
				UserMessage			= New UserMessage;
				UserMessage.Text	= NStr("en='Warning, new base unit has multiplier 1. Check multipliers corectness, please.';ru='Внимание, новая базовая единица имеет коэффициент 1. Проверьте, пожалуйста, коэффициенты на правильность.';cz='Warning, new base unit has multiplier 1. Check multipliers corectness, please.'");
				
				UserMessage.Message();
				
			EndIf;
			
		EndIf;
		
	EndIf;
	
EndProcedure

&AtServer
Function GetConstant()
	Return Constants.SKUFeaturesRegistration.Get();
EndFunction // ()

&AtServer
Function OnOpenAtServer()
	
	Items.Code.ReadOnly 	= 	Not Users.HaveAdditionalRight(Catalogs.AdditionalAccessRights.EditCatalogNumbers);
	
EndFunction // ()

&AtServer
Function ChangePackAvailable(mPack)
	
	If ValueIsFilled(Object.Ref) Then 
		
		Query = New Query;
		Query.Text = 
			"SELECT
			|	AssortmentMatrixSKUs.AssortmentMatrix AS AM,
			|	AssortmentMatrixSKUs.AssortmentMatrix.Code AS Code
			|FROM
			|	InformationRegister.AssortmentMatrixSKUs AS AssortmentMatrixSKUs
			|WHERE
			|	AssortmentMatrixSKUs.SKU = &SKU
			|	AND AssortmentMatrixSKUs.Unit = &Pack
			|
			|GROUP BY
			|	AssortmentMatrixSKUs.AssortmentMatrix,
			|	AssortmentMatrixSKUs.AssortmentMatrix.Code";
		
		Query.SetParameter("SKU", Object.Ref);
		Query.SetParameter("Pack", mPack);
		
		QueryResult = Query.Execute();
		
		Selection = QueryResult.Select();
		
		ReturnResult = True;
		
		While Selection.Next() Do
			
			ReturnResult = False;
			
			UserMessage			= New UserMessage;
			UserMessage.Text	= NStr("en = 'SKU and Packing used in the assortment matrix " + String(Selection.Code) + " - """ + String(Selection.AM) + """.'; ru = 'Номенклатура и упаковка используются в ассортиментной матрице " + String(Selection.Code) + " - """ + String(Selection.AM) + """.'");
			
			UserMessage.Message();
			
		EndDo;
		
		If Not ReturnResult Then 
			
			UserMessage			= New UserMessage;
			UserMessage.Text	= NStr("en='Change prohibited.';ru='Изменение запрещено.';cz='Změny jsou zakázány'");
			
			UserMessage.Message();
			
		EndIf;
		
		Return ReturnResult;
		
	Else 
		
		Return True;
		
	EndIf;
	
EndFunction

#EndRegion

#Region UserInterface

&AtClient
Procedure OnOpen(Cancel)
	
	OnOpenAtServer();	
	Items.Stock.ReadOnly 	= 	GetConstant();
	
EndProcedure

&AtClient
Procedure BaseUnitOnChange(Item)
	
	CheckBaseUnitAndMultiplier();
	
EndProcedure

&AtClient
Procedure PackingBeforeDeleteRow(Item, Cancel)
	
	If Not Items.Packing.CurrentData = Undefined Then 
		
		Cancel = Not ChangePackAvailable(Items.Packing.CurrentData.Pack);
		
	EndIf;
	
EndProcedure

&AtClient
Procedure PackingBeforeRowChange(Item, Cancel)
	
	If Item.CurrentItem = Items.PackingPack Then 
	
		If Not Items.Packing.CurrentData = Undefined Then 
			
			Cancel = Not ChangePackAvailable(Items.Packing.CurrentData.Pack);
			
		EndIf;
		
	EndIf;
	
EndProcedure

#Region Pictures

&AtClient
Procedure DeletePicture(Command)
	
	NewPictureName 		= Undefined;
	NewPictureExtension = Undefined;
	
	Object.DefaultPicture 			= Undefined;
	Object.DefaultPictureExtension 	= Undefined;
	
	PictureAddress = "";
	
	Modified = True;
	
EndProcedure

&AtClient
Procedure OpenPicture(Command)
	
	If ValueIsFilled(Object.DefaultPicture) Then 
		
		SnapshotStructure = CommonProcessors.GetSnapshot(Object.DefaultPicture, ThisForm.UUID, Object.Description);
		
		If Not SnapshotStructure = Undefined Then 
			
			GetFile(SnapshotStructure.SnapshotAddress, SnapshotStructure.SnapshotName, True);
			
		EndIf;
		
		
	ElsIf ValueIsFilled(NewPictureName) Then 
		
		SnapshotStructure = CommonProcessors.GetSnapshot(NewPictureName, ThisForm.UUID, Object.Description);
		
		If Not SnapshotStructure = Undefined Then 
			
			GetFile(SnapshotStructure.SnapshotAddress, SnapshotStructure.SnapshotName, True);
			
		EndIf;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure PictureAddressClick(Item, StandardProcessing)
	
	StandardProcessing = False;
	
	SelectPicture();
	
EndProcedure

&AtClient
Procedure SelectPicture()
	
	OpenForm("CommonForm.PickPictureFromForm", , ThisForm, , , , New NotifyDescription("SelectPictureProcessing", ThisForm));
	
EndProcedure

&AtClient
Procedure SelectPictureProcessing(Result, AdditionalParameter) Export 
	
	If Not Result = Undefined Then
		
		ThisForm.PictureAddress			= Result.StorageAddress;
		ThisForm.NewPictureName			= Result.FileName;
		ThisForm.NewPictureExtension	= Result.Extension;
		ThisForm.NewPictureType			= Result.Type;
		
		Object.DefaultPicture			= Undefined;
		Object.DefaultPictureExtension	= Undefined;
		
		Items.PictureAddress.Refresh();
		
		Modified = True;
		
	EndIf;
	
EndProcedure

#EndRegion

#EndRegion
